[["achievements",{"version":2,"data":{"vecHighlight":[],"vecUnachieved":[],"vecAchievedHidden":[],"nTotal":0,"nAchieved":0}}],["achievementmap",{"version":4,"data":"[]"}],["usernews",{"version":4,"data":[]}],["gameactivity",{"version":4,"data":[]}],["friends",{"version":1,"data":{"your_info":{"minutes_played_forever":299,"owned":true},"in_game":[],"played_recently":[],"played_ever":[{"steamid":"76561198033807605","minutes_played_forever":4},{"steamid":"76561198044708035","minutes_played_forever":1971},{"steamid":"76561198067218636","minutes_played_forever":682}],"owns":[{"steamid":"76561198046341287"},{"steamid":"76561198025248385"}],"in_wishlist":[]}}],["socialmedia",{"version":3,"data":[]}],["associations",{"version":2,"data":{"rgDevelopers":[{"strName":"Microsoft Game Studios","strURL":"https://store.steampowered.com/developer/XboxGameStudios"}],"rgPublishers":[{"strName":"Xbox Game Studios","strURL":"https://store.steampowered.com/publisher/XboxGameStudios"}],"rgFranchises":[]}}],["descriptions",{"version":1,"data":{"strFullDescription":"[b]Take to the skies in the World’s favourite flight simulator![/b]\r\n\r\nThe multi award winning Microsoft Flight Simulator X lands on Steam for the first time. Take off from anywhere in the world, flying some of the world’s most iconic aircraft to any one of 24,000 destinations. Microsoft Flight Simulator X Steam Edition has updated multiplayer and Windows 8.1 support.\r\n\r\nTake the controls of aircraft such as the 747 jumbo jet, F/A-18 Hornet, P-51D Mustang, EH-101 helicopter and others - an aircraft for every kind of flying and adventure. Select your starting location, set the time, the season, and the weather. Take off from one of more than 24,000 airports and explore a world of aviation beauty that has entranced millions of plane fans from across the globe.\r\n\r\nFSX Steam Edition offers players a connected world where they can choose who they want to be, from air-traffic controller to pilot or co-pilot. Racing mode allows you to compete against friends with four types of racing, including Red Bull Air Race courses, the unlimited Reno National Championship course, as well as cross country, competition sailplane courses and fictional courses like the Hoop and Jet Canyon. Test your skills with three different levels of difficulty, from simple pylon racing to racing highly challenging courses in a variety of weather conditions.\r\n\r\nWith over 80 missions, test your prowess to earn rewards. Try your hand at Search and Rescue, Test Pilot, Carrier Operations, and more. Keep track of how you have done on each mission and improve your skill levels until you’re ready for the next challenge.\r\n\r\nFSX Steam Edition enables pilots to fly the aircraft of their dreams, from the De Havilland DHC-2 Beaver floatplane and Grumman G-21A Goose to the AirCreation 582SL Ultralight and Maule M7 Orion with wheels and skis. Add to your collection of aircraft and improve the fidelity of your world with FSX Add-ons.\r\n\r\nThe inclusion of AI-controlled jetways, fuel trucks and moving baggage carts, adds extra realism to the experience of flying at busy airports.\r\n\r\nWhether you want to challenge your friends to a heart-pounding race or just take in the scenery, FSX Steam Edition will immerse you in a dynamic, living world that brings a realistic flying experience into your home.\r\n\r\nDownload size: 16.4GB\r\n\r\n[i]PLEASE NOTE\r\n\r\nMicrosoft Flight Simulator X:  Steam Edition (FSX: Steam Edition) is functionally similar to the boxed version of Microsoft Flight Simulator X (MSFSX). We have worked extensively with third party developers to make sure the two products can work alongside each other, however due to the wide range of add-on products available for MSFSX, we cannot guarantee that your existing content will work with Microsoft Flight Simulator X Steam Edition.\r\n\r\nThe Flight Simulator X Software Development Kit (SDK) is not included with FSX: Steam Edition.\r\n\r\nIf you already have MSFSX installed on your PC and are concerned about running the two games alongside each other, you may wish to consider installing FSX: Steam Edition on a separate PC. \r\n\r\nIf you already have MSFSX and add-ons installed they will only be accessible through your existing installation. They will not be duplicated across the original edition and Steam Edition of the simulator.[/i]\r\n\r\n\r\n[h2]Included Aircraft[/h2]\r\n[list]\r\n[*]Augusta Westland EH101 (Helicopter)\r\n[*]Airbus A321\r\n[*]AirCreation 582L Trike Ultralight\r\n[*]Beechcraft Baron 58\r\n[*]Beechcraft King Air 350\r\n[*]Bell 206B JetRanger (Helicopter)\r\n[*]Boeing 737-800\r\n[*]Boeing 747-400\r\n[*]Boeing F/A-18\r\n[*]Bombardier CRJ700\r\n[*]Bombardier LearJet 45\r\n[*]Cessna C172SP Skyhawk\r\n[*]Cessna C208B Grand Caravan\r\n[*]De Havilland DHC-2 Beaver\r\n[*]DG Flugzeugbau DG-808S\r\n[*]Douglas DC3\r\n[*]Extra 300S\r\n[*]Gumman G21A Goose \r\n[*]Maule M7 Orion\r\n[*]Maule M7 Orion (on skis)\r\n[*]Mooney Bravo\r\n[*]North American P-51D Mustang\r\n[*]Piper J-3 Cub\r\n[*]Robinson R22 Beta II (Helicopter)\r\n[/list]\r\n\r\n[url=http://store.steampowered.com/dlc/314160][img]https://cdn.akamai.steamstatic.com/steam/apps/314160/extras/FSX_DLC_Banner_616x216.jpg?t=1667504069[/img][/url]","strSnippet":"Take to the skies in the World’s favourite flight simulator! The multi award winning Microsoft Flight Simulator X lands on Steam for the first time. Take off from anywhere in the world, flying some of the world’s most iconic aircraft to any one of 24,000 destinations."}}]]